app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    # respond_to do |format|
    if @post.save
---
INSERT INTO "posts" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "pradeep"], ["email", "pradeepkushwaha232365@gmail.com"], ["created_at", "2024-01-11 12:12:47.475051"], ["updated_at", "2024-01-11 12:12:47.475051"]]